package day12;
/**
 * 1 A
 * 
 * @author TeduJAVA
 *
 */
public class prictice {
/*
 * 简述SAX和DOM解析方式的不同
 * SAX--效率高，但是不能改
 * DOM--数据是树形结构解析，效率低，可以修改
 * 
 * DOM:(Document Object Model,即文档对象模型)是W3C组织
 * 推荐的处理XML的一种方式。DOM解析器在解析XML文档时，
 * 会把文档中的所有元素，按照其出现的层次关系，解析成各个
 * Node对象(节点)。
 * 优点:把xml文件在内存中构造树形结构，可以遍历和修改节点
 * 缺点:如果文件比较大，内存有压力，解析时间会比较长
 * SAX(simple API for XML)是一种XML解析的替代方法。相比于
 * DOM,SAX是一种速度更快，更有效的方法。它逐行扫描文档，一边扫描
 * 一边解析。而且相比于DOM,SAX可以在解析文档的任意时刻停止解析。
 * 优点:解析可以立即开始，速度快，没有内存压力
 * 缺点:不能对节点做修改
 * 
 * 客户端以XML格式向服务器端发送数据V1
 * 
 */
}

























